# vsoStateGetParamChng

## Description
```pascal
FUNCTION vsoStateGetParamChng(
				hObj          : HANDLE;
				VAR outWidgID : LONGINT;
				VAR outPrmIdx : INTEGER;
				VAR outOldVal : STRING) : BOOLEAN;
```

```python

def vs.vsoStateGetParamChng(hObj):
    return (BOOLEAN, outWidgID, outPrmIdx, outOldVal)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObj|HANDLE||
|outWidgID|LONGINT||
|outPrmIdx|INTEGER||
|outOldVal|STRING||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events